app/views/gremios/new.html.erb

					<option><%= @expedient.nombre %></option>
					<% Perjudicado.where(:expedient_id => params[:id]).each do |perjudicado| %>
---
SELECT "perjudicados".* FROM "perjudicados" WHERE "perjudicados"."expedient_id" IS NULL