app/controllers/expedients_controller.rb

SELECT "expedients".* FROM "expedients" WHERE "expedients"."created_at" = 25 LIMIT 1
---
  def index
    @expedients = Expedient.all

SELECT "expedients".* FROM "expedients" WHERE "expedients"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @expedient = Expedient.find(params[:id])

SELECT "expedients".* FROM "expedients" WHERE "expedients"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @expedient = Expedient.find(params[:id])

INSERT INTO "expedients" ("agente", "apellido1", "apellido2", "cPostal", "calle", "categoria", "ciaProced", "compania", "contacto", "contactoAsegurado", "created_at", "dFact", "danos", "descripcion", "domicilio", "estado", "esteticos", "esteticosName", "franquicia", "localidad", "maxAuto", "nif", "nombre", "numPoliza", "numRef", "numero", "perito", "peritoName", "piso", "poblacion", "refCia", "tipo", "tlf1", "tlf2", "tlfCia", "updated_at", "urgente", "valorFranquicia", "zona") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @expedient = Expedient.new(params[:expedient])

    respond_to do |format|
      if @expedient.save

SELECT "expedients".* FROM "expedients" WHERE "expedients"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "expedients" SET "apellido1" = 'Bayo Nieto', "updated_at" = '2011-12-17 23:29:24.017585', "cPostal" = 8038, "domicilio" = 'carrer del Gaia', "piso" = '3º 2ª', "poblacion" = 'Barcelona', "numero" = '1', "nombre" = 'David', "tlf1" = 675749743, "localidad" = 'Barcelona' WHERE "expedients"."id" = 1
---
  def update
    @expedient = Expedient.find(params[:id])

    respond_to do |format|
      if @expedient.update_attributes(params[:expedient])

SELECT "expedients".* FROM "expedients" WHERE "expedients"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "expedients" WHERE "expedients"."id" = ?  [["id", 1]]
---
  def destroy
    @expedient = Expedient.find(params[:id])
    @expedient.destroy

SELECT "expedients".* FROM "expedients" WHERE (1)
---
  def renderSearch
    @expedient = Expedient.where(params[:expedient])

INSERT INTO "perjudicados" ("created_at", "descripcion", "direccion", "expedient_id", "nombre", "telefono1", "telefono2", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def addPerjudicado
    @perjudicado = Perjudicado.create(:nombre => params[:perjudicado][:nombre], :direccion => params[:perjudicado][:direccion], :telefono1 => params[:perjudicado][:telefono1], :telefono2 => params[:perjudicado][:telefono2], :descripcion => params[:perjudicado][:descripcion], :expedient_id => params[:expedient_id])