app/controllers/gremios_controller.rb

SELECT "expedients".* FROM "expedients" WHERE "expedients"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "gremios".* FROM "gremios"
---
  def index
    @expedient = Expedient.find(params[:expedient_id])
    @gremios = Gremio.all

SELECT "expedients".* FROM "expedients" WHERE "expedients"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "gremios".* FROM "gremios" WHERE "gremios"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @expedient = Expedient.find(params[:expedient_id])
    @gremio = Gremio.find(params[:id])

SELECT "expedients".* FROM "expedients" WHERE "expedients"."id" = ? LIMIT 1  [["id", "1"]]
---
  def new
    @expedient = Expedient.find(params[:expedient_id])

SELECT "expedients".* FROM "expedients" WHERE "expedients"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "gremios".* FROM "gremios" WHERE "gremios"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @expedient = Expedient.find(params[:expedient_id])
    @gremio = Gremio.find(params[:id])

SELECT "expedients".* FROM "expedients" WHERE "expedients"."id" = ? LIMIT 1  [["id", "3"]]
INSERT INTO "gremios" ("FechaFin", "HFin", "Hora", "albaranada", "conformeAseg", "created_at", "descripcion", "destFact", "expedient_id", "facturada", "finPrev", "gremio", "iva", "prof", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @expedient = Expedient.find(params[:expedient_id])
    @gremio = @expedient.gremios.new(params[:gremio])

    respond_to do |format|
      if @gremio.save

SELECT "expedients".* FROM "expedients" WHERE "expedients"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "gremios".* FROM "gremios" WHERE "gremios"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "gremios" SET "finPrev" = '2008-08-28', "updated_at" = '2011-12-28 11:57:34.590030' WHERE "gremios"."id" = 3
---
  def update
    @expedient = Expedient.find(params[:expedient_id])
    @gremio = Gremio.find(params[:id])

    respond_to do |format|
      if @gremio.update_attributes(params[:gremio])