app/views/expedients/edit.html.erb

			<tbody id="tablePerjudicados" style="text-align: center;">
				<% @expedient.perjudicados.order("created_at DESC").each do |perjudicado| %>
---
SELECT "perjudicados".* FROM "perjudicados" WHERE "perjudicados"."expedient_id" = 1 ORDER BY created_at DESC