app/views/expedients/index.html.erb

SELECT "expedients".* FROM "expedients" WHERE "expedients"."created_at" = 25 LIMIT 1
SELECT COUNT(*) FROM "expedients" WHERE ( created_at between '2011-12-25 00:00:00.000000' AND '2011-12-25 23:59:59.999999')
---
		<td>ABIERTOS</td>
		<td><%= Expedient.where(" created_at between ? AND ?", Time.zone.now.beginning_of_day, Time.zone.now.end_of_day ).count%></td>